In [1]:
from faker import Faker
import random
f=Faker()
data={"names": [f.name() for i in range(15)], "salaries": [random.randint(100000,200000) for i in range(15)]}
print(data)

{'names': ['Matthew Oneill', 'Kathy Berry', 'Susan Macias', 'Elizabeth Brown', 'Debbie Peters', 'Jackson Anderson', 'Martin Edwards', 'Travis Cole', 'Michelle Mann', 'Tara Hendrix', 'Miss Alyssa Gonzalez', 'Michael Jones', 'Michelle Turner', 'Jacob Romero', 'Brandon Hays'], 'salaries': [195591, 111467, 131235, 148088, 106353, 140476, 112243, 104076, 105773, 183608, 154556, 102765, 111673, 174154, 154001]}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(data)

In [4]:
df

                   names  salaries
0         Matthew Oneill    195591
1            Kathy Berry    111467
2           Susan Macias    131235
3        Elizabeth Brown    148088
4          Debbie Peters    106353
5       Jackson Anderson    140476
6         Martin Edwards    112243
7            Travis Cole    104076
8          Michelle Mann    105773
9           Tara Hendrix    183608
10  Miss Alyssa Gonzalez    154556
11         Michael Jones    102765
12       Michelle Turner    111673
13          Jacob Romero    174154
14          Brandon Hays    154001

In [5]:
df.head()

             names  salaries
0   Matthew Oneill    195591
1      Kathy Berry    111467
2     Susan Macias    131235
3  Elizabeth Brown    148088
4    Debbie Peters    106353

In [6]:
df.tail()

                   names  salaries
10  Miss Alyssa Gonzalez    154556
11         Michael Jones    102765
12       Michelle Turner    111673
13          Jacob Romero    174154
14          Brandon Hays    154001

In [7]:
df.head(10)

              names  salaries
0    Matthew Oneill    195591
1       Kathy Berry    111467
2      Susan Macias    131235
3   Elizabeth Brown    148088
4     Debbie Peters    106353
5  Jackson Anderson    140476
6    Martin Edwards    112243
7       Travis Cole    104076
8     Michelle Mann    105773
9      Tara Hendrix    183608

In [8]:
df.sample()

           names  salaries
14  Brandon Hays    154001

In [9]:
df.sample(10)

                   names  salaries
1            Kathy Berry    111467
2           Susan Macias    131235
5       Jackson Anderson    140476
6         Martin Edwards    112243
4          Debbie Peters    106353
10  Miss Alyssa Gonzalez    154556
13          Jacob Romero    174154
9           Tara Hendrix    183608
14          Brandon Hays    154001
12       Michelle Turner    111673

In [10]:
df.describe()

            salaries
count      15.000000
mean   135737.266667
std     31400.535843
min    102765.000000
25%    108910.000000
50%    131235.000000
75%    154278.500000
max    195591.000000

In [11]:
df.salaries

0     195591
1     111467
2     131235
3     148088
4     106353
5     140476
6     112243
7     104076
8     105773
9     183608
10    154556
11    102765
12    111673
13    174154
14    154001
Name: salaries, dtype: int64

In [12]:
df.salaries.mean()

135737.26666666666

In [13]:
df[df['salaries']>106353]

                   names  salaries
0         Matthew Oneill    195591
1            Kathy Berry    111467
2           Susan Macias    131235
3        Elizabeth Brown    148088
5       Jackson Anderson    140476
6         Martin Edwards    112243
9           Tara Hendrix    183608
10  Miss Alyssa Gonzalez    154556
12       Michelle Turner    111673
13          Jacob Romero    174154
14          Brandon Hays    154001

In [14]:
df[df['salaries']>df.salaries.mean()]

                   names  salaries
0         Matthew Oneill    195591
3        Elizabeth Brown    148088
5       Jackson Anderson    140476
9           Tara Hendrix    183608
10  Miss Alyssa Gonzalez    154556
13          Jacob Romero    174154
14          Brandon Hays    154001

In [16]:
df.to_csv("emp.csv")

In [18]:
df.to_csv("emp.csv", index=False)

In [20]:
emp_df = pd.read_csv("emp.csv")

In [21]:
print(emp_df)

                   names  salaries
0         Matthew Oneill    195591
1            Kathy Berry    111467
2           Susan Macias    131235
3        Elizabeth Brown    148088
4          Debbie Peters    106353
5       Jackson Anderson    140476
6         Martin Edwards    112243
7            Travis Cole    104076
8          Michelle Mann    105773
9           Tara Hendrix    183608
10  Miss Alyssa Gonzalez    154556
11         Michael Jones    102765
12       Michelle Turner    111673
13          Jacob Romero    174154
14          Brandon Hays    154001

In [22]:
 pd.read_csv?

In [23]:
emp_df = pd.read_csv("emp.csv", nrows=5)
print(emp_df)

             names  salaries
0   Matthew Oneill    195591
1      Kathy Berry    111467
2     Susan Macias    131235
3  Elizabeth Brown    148088
4    Debbie Peters    106353

In [24]:
emp_df = pd.read_csv?

In [25]:
emp_df = pd.read_csv("emp.csv", nrows=5,skiprows=5)
print(emp_df)

      Debbie Peters  106353
0  Jackson Anderson  140476
1    Martin Edwards  112243
2       Travis Cole  104076
3     Michelle Mann  105773
4      Tara Hendrix  183608

In [26]:
emp_df = pd.read_csv("emp.csv", nrows=5,skiprows=10)
print(emp_df)

           Tara Hendrix  183608
0  Miss Alyssa Gonzalez  154556
1         Michael Jones  102765
2       Michelle Turner  111673
3          Jacob Romero  174154
4          Brandon Hays  154001